TienHuyIoT/esp_wifi_template/Manager_Wifi/esp8266_wifi_template/hth_esp_wifi.cpp
  // ??? To register evetn, must be declare accessPointDisconnectedHandler
  accessPointDisconnectedHandler = WiFi.onStationModeDisconnected(
    [](const WiFiEventStationModeDisconnected& evt) {
      ESP_WIFI_TAG_CONSOLE("[EVENT] WiFi lost connection to %s. Reason: %u", 
      evt.ssid.c_str(), evt.reason);
      /* Note: running setAutoReconnect(true) when module is already disconnected 
      will not make it reconnect to the access point. Instead reconnect() 
      should be used. 
        We don't need call WiFi.reconnect() once loss connection, it is self reconnect after loss connection.
      Reconnecting will be destroy, if executing scan network.
      */
      constexpr uint32_t RECONNECT_SECOND_TIMEOUT = 15;
      // manual reconnect after an expired timeout
      _reconnetTicker.once(RECONNECT_SECOND_TIMEOUT, [](){
        ESP_WIFI_TAG_CONSOLE("Reconnecting");
        WiFi.reconnect();
      });
    }
  );
#endif
}

#if (defined DDNS_CLIENT_ENABLE) && (DDNS_CLIENT_ENABLE == 1)  
void hth_esp_wifi::onDDNSclient()
{
  if (WFDataFile.disableDDNS())
  {
      ESP_WIFI_TAG_CONSOLE("[DDNS] client disable");
      return;
  }

  if (ddnsClient)
  {
    return;
  }
  
  ddnsClient = new hth_AsyncEasyDDNSClass();
    /*
    List of supported DDNS providers:
    - "duckdns"
    - "noip"
    - "dyndns"
    - "dynu"
    - "enom"
    - "all-inkl"
    - "selfhost.de"
    - "dyndns.it"
    - "strato"
    - "freemyip"
    - "afraid.org"
  */
  ddnsClient->service(WFDataFile.serviceDDNS());

  // Get Notified when your IP changes
  ddnsClient->onUpdateIP([&](const char* oldIP, const char* newIP){
    ESP_WIFI_TAG_CONSOLE("[DDNS] AsyncEasyDDNS - IP Change Detected: %s", newIP);
  });

  /*
    For DDNS Providers where you get a token:
      Use this: ddnsClient->begin("domain", "token");
    
    For DDNS Providers where you get username and password: ( Leave the password field empty "" if not required )
      Use this: ddnsClient->begin("domain", "username", "password");
  */
  ddnsClient->begin(WFDataFile.domainDDNS(), WFDataFile.userDDNS(), WFDataFile.passDDNS());

  constexpr uint8_t DDNS_SYNC_TIME_MIN = 10; // should not zero
  constexpr uint8_t DDNS_SYNC_TIME_MAX = 60; // unlimited
  if (WFDataFile.syncTimeDDNS() < DDNS_SYNC_TIME_MIN)
  {
    WFDataFile.syncTimeDDNSSet(DDNS_SYNC_TIME_MIN);
  }

  if (WFDataFile.syncTimeDDNS() > DDNS_SYNC_TIME_MAX)
  {
    WFDataFile.syncTimeDDNSSet(DDNS_SYNC_TIME_MAX);
  }

  _ddnsTicker.attach(WFDataFile.syncTimeDDNS(), [](){
    if (!WFDataFile.disableDDNS())
    {
      ddnsClient->update();
    }  
  }); 
}
#endif

/* Should be called on wifi event gotIP */
#if (defined MDNS_SERVICE_ENABLE) && (MDNS_SERVICE_ENABLE == 1)
void hth_esp_wifi::onMDNSService()
{
  // Set up mDNS responder:
  // - first argument is the domain name, in this example
  //   the fully-qualified domain name is "esp32.local"
  // - second argument is the IP address to advertise
  //   we send our IP address on the WiFi network
  if (!MDNS.begin(WFDataFile.hostNameSTA().c_str()))
  {
    ESP_WIFI_TAG_CONSOLE("Error setting up MDNS responder!");
  }
  else
  {
    ESP_WIFI_TAG_CONSOLE("mDNS responder started");
  }

  /** alway 80, because we have redirect port 80 to server port 
   * This function must be run after MDNS.begin()
  */
  MDNS.addService("http", "tcp", 80);
}
#endif

#if (defined DNS_SERVER_ENABLE) && (DNS_SERVER_ENABLE == 1)
void hth_esp_wifi::onDNSServer()
{
  constexpr uint16_t DNS_SERVER_PORT = 53;
  _dnsServer->setErrorReplyCode(DNSReplyCode::ServerFailure);
  _dnsServer->start(DNS_SERVER_PORT, WFDataFile.dnsNameAP(), WiFi.softAPIP());  
}
#endif

/** Should be called on wifi event gotIP*/
#if (defined NBNS_SERVICE_ENABLE) && (NBNS_SERVICE_ENABLE == 1)
void hth_esp_wifi::onNBNSService()
{
  NBNS.begin(WFDataFile.hostNameSTA().c_str());
}
#endif

/** Should be called after init wifi */
#if (defined OTA_ARDUINO_ENABLE) && (OTA_ARDUINO_ENABLE == 1)
uint32_t hth_esp_wifi::_otaArduinoPercent = 0;
void hth_esp_wifi::onArduinoOTA()
{
  ArduinoOTA.onStart(
      []()
      {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
        {
          type = "sketch";
        }
        else // U_SPIFFS
        {
          type = "filesystem";
          NAND_FS_SYSTEM.end();
        }

        _reconnetTicker.detach(); // disable wifi auto reconnect access point

        /** NOTE: if updating SPIFFS this would be the place
         *  to unmount SPIFFS using SPIFFS.end() */
        ESP_WIFI_TAG_CONSOLE("[OTA] Start updating %s", type.c_str());
      });

  ArduinoOTA.onEnd([]()
                   { ESP_WIFI_TAG_CONSOLE("[OTA] End"); });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        {
                          uint32_t per = progress * 100 / total;
                          if (_otaArduinoPercent != per)
                          {
                            _otaArduinoPercent = per;
                            ESP_WIFI_TAG_CONSOLE("[OTA] Progress: %u%%", per);
                          }
                          /* Watch dog timer feed */
                          // hw_wdt_feed();
                        });

  ArduinoOTA.onError([](ota_error_t error)
                     {
                       ESP_WIFI_TAG_CONSOLE("[OTA] Error[%u]: ", error);
                       if (error == OTA_AUTH_ERROR)
                       {
                         ESP_WIFI_CONSOLE("Auth Failed");
                       }
                       else if (error == OTA_BEGIN_ERROR)
                       {
                         ESP_WIFI_CONSOLE("Begin Failed");
                       }
                       else if (error == OTA_CONNECT_ERROR)
                       {
                         ESP_WIFI_CONSOLE("Connect Failed");
                       }
                       else if (error == OTA_RECEIVE_ERROR)
                       {
                         ESP_WIFI_CONSOLE("Receive Failed");
                       }
                       else if (error == OTA_END_ERROR)
                       {
                         ESP_WIFI_CONSOLE("End Failed");
                       }
                     });

